{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false, "name": "inp"}, "inbound_nodes": []}, {"name": "sf", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false, "name": "sf"}, "inbound_nodes": []}, {"name": "multiply_7", "class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true}, "inbound_nodes": [[["inp", 0, 0, {}], ["sf", 0, 0, {}]]]}, {"name": "encoder", "class_name": "Dense", "config": {"name": "encoder", "trainable": true, "units": 23, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_7", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Dense", "config": {"name": "decoder", "trainable": true, "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder", 0, 0, {}]]]}, {"name": "mean_scaled", "class_name": "Lambda", "config": {"name": "mean_scaled", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0012\u0000\u0000\u0000t\u0000j\u0001t\u0000j\u0002|\u0000\u0083\u0001d\u0001\u0083\u0002S\u0000)\u0002Ng\u0000\u0000\u0000\u0000\u0000j\u00f8@)\u0003\u00da\u0001K\u00da\u0007minimum\u00da\u0003exp)\u0001\u00da\u0001x\u00a9\u0000r\u0005\u0000\u0000\u0000\u00fa>/Users/agne/workdir/autoCorrect/src/autoCorrect/autoencoder.py\u00da\b<lambda>\u0012\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [1000], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["decoder", 0, 0, {}]]]}, {"name": "inv", "class_name": "Lambda", "config": {"name": "inv", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000t\u0000j\u0001|\u0000d\u0002\u0083\u0002S\u0000)\u0003N\u00e9\u0001\u0000\u0000\u0000\u00e9\u00ff\u00ff\u00ff\u00ff)\u0002\u00da\u0001K\u00da\u0003pow)\u0001\u00da\u0001x\u00a9\u0000r\u0006\u0000\u0000\u0000\u00fa>/Users/agne/workdir/autoCorrect/src/autoCorrect/autoencoder.py\u00da\b<lambda>\u0013\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [1000], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["sf", 0, 0, {}]]]}, {"name": "multiply_8", "class_name": "Multiply", "config": {"name": "multiply_8", "trainable": true}, "inbound_nodes": [[["mean_scaled", 0, 0, {}], ["inv", 0, 0, {}]]]}, {"name": "dispersion", "class_name": "ConstantDispersionLayer", "config": {"name": "dispersion", "trainable": true}, "inbound_nodes": [[["multiply_8", 0, 0, {}]]]}], "input_layers": [["inp", 0, 0], ["sf", 0, 0]], "output_layers": [["dispersion", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}